app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-03-29 03:01:32.657051"], ["updated_at", "2018-03-29 03:01:32.657051"]]
---
  def create
<<<<<<< HEAD
    @student = Student.new(post_params(:first_name,:last_name))
=======
    @student = Student.new(post_params(:title,:room_number))
>>>>>>> 81c1d8c3976a1882e56d41819b16d665fd9582bc
  	@student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-03-29 03:05:48.148920"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
  	@student.update(post_params(:first_name,:last_name))